############################################
print('№1')
K = input('Количество студентов: ')
N = input('Количество шаурмы: ')
a = int(N) // int(K)
print('Достанется каждому студенту', a)
b = int(N) % int(K)
print('Останется в холодильнике', b)
#############################################
print('№3')
hours = 10
minutes = 00
summ = 0
for i in range(3):
    b = int(input('Время, требуемое для выполнения дела: '))
    summ = summ + b
c = hours + summ // 60
d = minutes + summ % 60
if d // 10 == 0:
    print(c, d, sep=':', end='0')
else:
    print(c, d, sep=':')
#############################################
print('№4')
a = input("Введите пароль: ")
b = input('Повторите пароль: ')
if a == b:
    print('Пароль принят!')
else:
    print('Пароль не принят! Введенные пароли не совпадают!')
#############################################
print('№5')
a = int(input('Введите число:'))
b = int(input('Введите число:'))
if a > b:
    print(a, "- наибольшее число")
    print(b, "- наименьшее число")
else:
    print(b, "- наибольшее число")
    print(a, "- наименьшее число")
#############################################
print('№6')
a = int(input('Ваш возраст: '))
if a < 18:
    print('Доступ запрещен')
else:
    print('Доступ разрешен')
#############################################
print('№7')
a = int(input("Введите трехзначное число: "))
b = a // 100
c = (a % 100) // 10
d = a % 10
if b > c:
    if c > d:
        print(b)
else:
    if b < c:
        if c > d:
            print(c)
        else:
            print(d)
#############################################
print('№8')
nechetn = 0
summ = 0
n = int(input('Введите количество значений: '))
for i in range(1, n + 1):
    a = int(input('Введите число: '))
    if a % 2 != 0:
        nechetn = nechetn + 1
        summ = summ + a
print('Количество нечетных: ', nechetn)
print('Сумма нечетных: ', summ)
